-- -------------------------------------------------------------
-- TablePlus 3.7.1(332)
--
-- https://tableplus.com/
--
-- Database: bloodbank
-- Generation Time: 2020-08-23 12:35:40.6330
-- -------------------------------------------------------------


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;


INSERT INTO `permissions` (`
id`,`name
`, `display_name`, `description`, `created_at`, `updated_at`, `group`) VALUES
('1', 'add-post', 'اضافة مقال', NULL, '2020-08-23 09:06:15', '2020-08-23 09:08:02', 'مقالات'),
('2', 'edit-post', 'تعديل مقال', NULL, '2020-08-23 09:06:15', '2020-08-23 09:07:55', 'مقالات'),
('3', 'delete-post', 'حذف مقال', NULL, '2020-08-23 09:06:45', '2020-08-23 09:07:48', 'مقالات'),
('4', 'show-posts', 'عرض مقالات', NULL, '2020-08-23 09:06:45', '2020-08-23 09:07:48', 'مقالات'),
('5', 'add-users', 'اضافة مستخدمين', NULL, '2020-08-23 09:07:07', '2020-08-23 09:07:41', 'مستخدمين'),
('6', 'edit-user', 'تعديل مستخدم', NULL, '2020-08-23 09:07:34', '2020-08-23 09:07:34', 'مستخدمين'),
('6', 'delete-user', 'حذف مستخدم', NULL, '2020-08-23 09:06:45', '2020-08-23 09:07:48', 'مستخدمين'),
('7', 'show-users', 'عرض مستخدمين', NULL, '2020-08-23 09:07:07', '2020-08-23 09:07:41', 'مستخدمين'),
('8', 'add-category', 'اضافة تصنيف', NULL, '2020-08-23 09:06:15', '2020-08-23 09:08:02', 'تصنيفات'),
('9', 'edit-category', 'تعديل تصنيف', NULL, '2020-08-23 09:06:15', '2020-08-23 09:07:55', 'تصنيفات'),
('10', 'delete-category', 'حذف تصنيف', NULL, '2020-08-23 09:06:45', '2020-08-23 09:07:48', 'تصنيفات'),
('11', 'show-categories', 'عرض تصنيفات', NULL, '2020-08-23 09:06:15', '2020-08-23 09:08:02', 'تصنيفات'),
('12', 'add-role', 'اضافة رتبة', NULL, '2020-08-23 09:07:07', '2020-08-23 09:07:41', 'رتب'),
('13', 'edit-role', 'تعديل رتبه', NULL, '2020-08-23 09:07:34', '2020-08-23 09:07:34', 'رتب'),
('14', 'delete-role', 'حذف رتبة', NULL, '2020-08-23 09:06:45', '2020-08-23 09:07:48', 'رتب'),
('15', 'show-roles', 'عرض رتب', NULL, '2020-08-23 09:07:07', '2020-08-23 09:07:41', 'رتب'),
('16', 'edit-government', 'تعديل محافظة', NULL, '2020-08-23 09:07:34', '2020-08-23 09:07:34', 'محافظة'),
('17', 'show-governments', 'عرض محافظة', NULL, '2020-08-23 09:06:15', '2020-08-23 09:08:02', 'محافظة'),
('18', 'delete-government', 'حذف محافظة', NULL, '2020-08-23 09:06:45', '2020-08-23 09:07:48', 'محافظة'),
('19', 'add-government', 'عرض محافظة', NULL, '2020-08-23 09:07:07', '2020-08-23 09:07:41', 'محافظة'),
('20', 'edit-city', 'اضافة مدينة', NULL, '2020-08-23 09:07:34', '2020-08-23 09:07:34', 'مدن'),
('21', 'show-cities', 'عرض مدن', NULL, '2020-08-23 09:06:15', '2020-08-23 09:08:02', 'مدن'),
('22', 'delete-city', 'حذف مدينة', NULL, '2020-08-23 09:06:45', '2020-08-23 09:07:48', 'مدن'),
('23', 'add-city', 'اضافة مدينة', NULL, '2020-08-23 09:07:07', '2020-08-23 09:07:41', 'مدن'),
('25', 'delete-client', 'حذف عميل', NULL, '2020-08-23 09:06:45', '2020-08-23 09:07:48', 'عملاء'),
('26', 'show-clients', 'عرض عملاء', NULL, '2020-08-23 09:06:45', '2020-08-23 09:07:48', 'عملاء'),
('27', 'delete-request', 'حذف طلب تبرع', NULL, '2020-08-23 09:06:45', '2020-08-23 09:07:48', 'عملاء'),
('28', 'show-requests', 'عرض طلبات التبرع', NULL, '2020-08-23 09:06:45', '2020-08-23 09:07:48', 'عملاء');


/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;
